In [5]:
import pandas as pd

In [6]:
Cus = "./Customers.csv"
Products = "./Products.csv"
S2015 = "./Sales_2015.csv"
S2016 = "./Sales_2016.csv"
S2017 = "./Sales_2017.csv"

#### Read multiple csv files

In [7]:
import pandas as pd

file_paths = ["./Customers.csv",
              "./Products.csv",
              "./Sales_2015.csv",
              "./Sales_2016.csv",
              "./Sales_2017.csv"]

dataframe_names = ["Cus", "Products", "S2015", "S2016", "S2017"]

for i in range(len(file_paths)):
    globals()[dataframe_names[i]] = pd.read_csv(file_paths[i], encoding='ISO-8859-1')

In [8]:
dataframes = [Cus, Products, S2015, S2016, S2017]
dataframe_names = ["Cus", "Products", "S2015", "S2016", "S2017"]
for df, name in zip(dataframes, dataframe_names):
    print("Data type of:", name)
    print(df.dtypes)
    print("*"*50)

Data type of: Cus
CustomerKey        int64
Prefix            object
FirstName         object
LastName          object
BirthDate         object
MaritalStatus     object
Gender            object
EmailAddress      object
AnnualIncome      object
TotalChildren      int64
EducationLevel    object
Occupation        object
HomeOwner         object
dtype: object
**************************************************
Data type of: Products
ProductKey                 int64
ProductSubcategoryKey      int64
ProductSKU                object
ProductName               object
ModelName                 object
ProductDescription        object
ProductColor              object
ProductSize               object
ProductStyle              object
ProductCost              float64
ProductPrice             float64
dtype: object
**************************************************
Data type of: S2015
OrderDate        object
StockDate        object
OrderNumber      object
ProductKey        int64
CustomerKey       int64
TerritoryKey      int64
OrderLineItem     int64
OrderQuantity     int64
dtype: object
**************************************************
Data type of: S2016
OrderDate        object
StockDate        object
OrderNumber      object
ProductKey        int64
CustomerKey       int64
TerritoryKey      int64
OrderLineItem     int64
OrderQuantity     int64
dtype: object
**************************************************
Data type of: S2017
OrderDate        object
StockDate        object
OrderNumber      object
ProductKey        int64
CustomerKey       int64
TerritoryKey      int64
OrderLineItem     int64
OrderQuantity     int64
dtype: object
**************************************************

In [9]:
Cus.head(3)

,CustomerKey,Prefix,FirstName,LastName,BirthDate,MaritalStatus,Gender,EmailAddress,AnnualIncome,TotalChildren,EducationLevel,Occupation,HomeOwner
0,11000,MR.,JON,YANG,4/8/1966,M,M,jon24@adventure-works.com,"$90,000",2,Bachelors,Professional,Y
1,11001,MR.,EUGENE,HUANG,5/14/1965,S,M,eugene10@adventure-works.com,"$60,000",3,Bachelors,Professional,N
2,11002,MR.,RUBEN,TORRES,8/12/1965,M,M,ruben35@adventure-works.com,"$60,000",3,Bachelors,Professional,Y

#### Check the shape

In [10]:
dataframes = [Cus, Products, S2015, S2016, S2017]
dataframe_names = ["Cus", "Products", "S2015", "S2016", "S2017"]
for df, name in zip(dataframes, dataframe_names):
    shape = df.shape
    print("The shape of:", name, "dataframe is", shape)

The shape of: Cus dataframe is (18148, 13)
The shape of: Products dataframe is (293, 11)
The shape of: S2015 dataframe is (2630, 8)
The shape of: S2016 dataframe is (23935, 8)
The shape of: S2017 dataframe is (29481, 8)

#### Check null values

In [11]:
dataframes = [Cus, Products, S2015, S2016, S2017]
dataframe_names = ["Cus", "Products", "S2015", "S2016", "S2017"]
for df, name in zip(dataframes, dataframe_names):
    no_null = df.isnull().sum().sum()
    print("="*50)
    print("The dataframe:", name, "has", no_null, "null values")
    print(df.isnull().sum())
    print("="*50)

==================================================
The dataframe: Cus has 260 null values
CustomerKey         0
Prefix            130
FirstName           0
LastName            0
BirthDate           0
MaritalStatus       0
Gender            130
EmailAddress        0
AnnualIncome        0
TotalChildren       0
EducationLevel      0
Occupation          0
HomeOwner           0
dtype: int64
==================================================
==================================================
The dataframe: Products has 50 null values
ProductKey                0
ProductSubcategoryKey     0
ProductSKU                0
ProductName               0
ModelName                 0
ProductDescription        0
ProductColor             50
ProductSize               0
ProductStyle              0
ProductCost               0
ProductPrice              0
dtype: int64
==================================================
==================================================
The dataframe: S2015 has 0 null values
OrderDate        0
StockDate        0
OrderNumber      0
ProductKey       0
CustomerKey      0
TerritoryKey     0
OrderLineItem    0
OrderQuantity    0
dtype: int64
==================================================
==================================================
The dataframe: S2016 has 0 null values
OrderDate        0
StockDate        0
OrderNumber      0
ProductKey       0
CustomerKey      0
TerritoryKey     0
OrderLineItem    0
OrderQuantity    0
dtype: int64
==================================================
==================================================
The dataframe: S2017 has 0 null values
OrderDate        0
StockDate        0
OrderNumber      0
ProductKey       0
CustomerKey      0
TerritoryKey     0
OrderLineItem    0
OrderQuantity    0
dtype: int64
==================================================

In [12]:
Cus["Prefix"].unique()

array(['MR.', 'MS.', 'MRS.', nan], dtype=object)

In [13]:
Cus["Gender"].unique()

array(['M', 'F', nan], dtype=object)

In [14]:
Products["ProductColor"].unique()

array(['Red', 'Black', 'White', 'Blue', 'Multi', 'Silver', 'Yellow', nan,
       'Grey', 'Silver/Black'], dtype=object)

#### Fill NA

##### Prefix

In [15]:
Cus_mode = Cus["Prefix"].mode()[0]
Cus_mode

'MR.'

In [16]:
Cus['Prefix'].fillna(Cus_mode, inplace=True)

C:\Users\phanc\AppData\Local\Temp\ipykernel_8936\1328651147.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  Cus['Prefix'].fillna(Cus_mode, inplace=True)

In [17]:
Cus["Prefix"].unique()

array(['MR.', 'MS.', 'MRS.'], dtype=object)

##### Gender

In [18]:
Cus["Gender"].fillna("M", inplace=True)

C:\Users\phanc\AppData\Local\Temp\ipykernel_8936\2457732852.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  Cus["Gender"].fillna("M", inplace=True)

In [19]:
Cus["Gender"].unique()

array(['M', 'F'], dtype=object)

In [20]:
Cus.isnull().sum().sum()

np.int64(0)

##### Color

In [21]:
Pro_mode = Products["ProductColor"].mode()[0]

In [22]:
Products["ProductColor"].fillna(Pro_mode, inplace=True)

C:\Users\phanc\AppData\Local\Temp\ipykernel_8936\1218603282.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  Products["ProductColor"].fillna(Pro_mode, inplace=True)

In [23]:
Products["ProductColor"].unique()

array(['Red', 'Black', 'White', 'Blue', 'Multi', 'Silver', 'Yellow',
       'Grey', 'Silver/Black'], dtype=object)

In [24]:
Products.isnull().sum().sum()

np.int64(0)

#### Check duplicated values

In [25]:
dataframes = [Cus, Products, S2015, S2016, S2017]
dataframe_names = ["Cus", "Products", "S2015", "S2016", "S2017"]
for df, name in zip(dataframes, dataframe_names):
    dupl = df.duplicated().sum()
    print("The dataframe:", name, "has", dupl, "duplicated values")

The dataframe: Cus has 0 duplicated values
The dataframe: Products has 0 duplicated values
The dataframe: S2015 has 0 duplicated values
The dataframe: S2016 has 0 duplicated values
The dataframe: S2017 has 0 duplicated values

In [26]:
S2016[S2016["CustomerKey"].duplicated()]

,OrderDate,StockDate,OrderNumber,ProductKey,CustomerKey,TerritoryKey,OrderLineItem,OrderQuantity
1707,7/1/2016,3/8/2003,SO51176,479,18239,9,2,1
1708,7/1/2016,3/17/2003,SO51188,606,12657,8,1,1
1710,7/1/2016,4/10/2003,SO51179,377,22430,7,1,1
1711,7/1/2016,4/27/2003,SO51179,486,22430,7,4,1
1712,7/1/2016,4/6/2003,SO51179,540,22430,7,2,1
...,...,...,...,...,...,...,...,...
23929,12/31/2016,10/14/2003,SO61111,214,17841,10,3,1
23930,12/31/2016,12/11/2003,SO61111,591,17841,10,1,1
23932,12/31/2016,11/4/2003,SO61147,528,12146,4,1,2
23933,12/31/2016,11/9/2003,SO61147,215,12146,4,3,1
23934,12/31/2016,11/16/2003,SO61147,537,12146,4,2,1

In [27]:
print(S2015["CustomerKey"].duplicated().sum())
print(S2016["CustomerKey"].duplicated().sum())
print(S2017["CustomerKey"].duplicated().sum())

0
14802
18979

#### Unique customer in each year

In [28]:
print("There are", S2015["CustomerKey"].nunique(), "different customers in total")
print("There are", S2016["CustomerKey"].nunique(), "different customers in total")
print("There are", S2017["CustomerKey"].nunique(), "different customers in total")

There are 2630 different customers in total
There are 9133 different customers in total
There are 10502 different customers in total

In [29]:
S = pd.concat([S2015, S2016, S2017], ignore_index=True)

In [30]:
S.shape

(56046, 8)

In [31]:
S.head(3)

,OrderDate,StockDate,OrderNumber,ProductKey,CustomerKey,TerritoryKey,OrderLineItem,OrderQuantity
0,1/1/2015,9/21/2001,SO45080,332,14657,1,1,1
1,1/1/2015,12/5/2001,SO45079,312,29255,4,1,1
2,1/1/2015,10/29/2001,SO45082,350,11455,9,1,1

In [32]:
print(S2017.shape)
S2017.nunique()

(29481, 8)

OrderDate          181
StockDate          287
OrderNumber      11839
ProductKey         102
CustomerKey      10502
TerritoryKey        10
OrderLineItem        8
OrderQuantity        3
dtype: int64

In [33]:
S.nunique()

OrderDate          911
StockDate         1001
OrderNumber      25164
ProductKey         130
CustomerKey      17416
TerritoryKey        10
OrderLineItem        8
OrderQuantity        3
dtype: int64

In [36]:
S.to_csv("Sales.csv", index=False)